/*******************************************************************************
 * Copyright (C), 2022, 羽落叶秋
 * @file    Timer.h
 * @brief   
 * @details 
 * @author  羽落叶秋
 * @version 1.0.0
 * @date    2022年06月30日
 * @History:
 *      1. Date: 2022-06-30
 *         Author: 羽落叶秋
 *         Modification: 新建
 ******************************************************************************/
#ifndef __TIMER_H
#define __TIMER_H

/*================================ 头文件包含 =================================*/
#include "Clibrary.h"

/*=============================== 宏定义/重定义 ===============================*/
#define BASIC_TIM_Period    (100)       //定时器周期，100Khz即10us，10us * 100次 = 1ms
#define BASIC_TIM_Prescaler (720 - 1)   //定时器预分频值，主频72Mhz / 720 = 100Khz

/*========================== 枚举体/联合体/结构体定义 ==========================*/
/**
 * @brief 基本时间标志
 * @note  0xAA表示基本时间到
 **/
typedef struct _basictimeflg {
    uint8 ms_one;   //1ms
    uint8 ms_five;  //5ms
    uint8 ms_ten;   //10ms
    uint8 ms_hundred;//100ms
    uint8 S_one;    //1S
} BASICTIMEFLAG_Tydef;


/*================================= 全局变量 =================================*/
extern uint16 BasicTime;    //基本定时器，单位1ms加1
extern BASICTIMEFLAG_Tydef BasicTimeFlg;   //基本时间标志

/*================================= 私有函数 =================================*/


/*================================= 接口函数 =================================*/
extern void TIM3_Init(void);

#endif
/*================================= 文件结尾 =================================*/
